Most examples taken from: __[10 minutes to Pandas](https://pandas.pydata.org/pandas-docs/version/0.23.4/10min.html#string-methods)__

In [2]:
# Import the `pandas` library as `pd`
import pandas as pd

# Load in the data with `read_csv()`
digits = pd.read_csv("http://archive.ics.uci.edu/ml/machine-learning-databases/optdigits/optdigits.tra", header=None)

# Print out `digits`
# print(digits)
digits

,0,1,2,3,4,5,6,7,8,9,...,55,56,57,58,59,60,61,62,63,64
0,0,1,6,15,12,1,0,0,0,7,...,0,0,0,6,14,7,1,0,0,0
1,0,0,10,16,6,0,0,0,0,7,...,0,0,0,10,16,15,3,0,0,0
2,0,0,8,15,16,13,0,0,0,1,...,0,0,0,9,14,0,0,0,0,7
3,0,0,0,3,11,16,0,0,0,0,...,0,0,0,0,1,15,2,0,0,4
4,0,0,5,14,4,0,0,0,0,0,...,0,0,0,4,12,14,7,0,0,6
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3818,0,0,5,13,11,2,0,0,0,2,...,0,0,0,8,13,15,10,1,0,9
3819,0,0,0,1,12,1,0,0,0,0,...,0,0,0,0,4,9,0,0,0,4
3820,0,0,3,15,0,0,0,0,0,0,...,0,0,0,4,14,16,9,0,0,6
3821,0,0,6,16,2,0,0,0,0,0,...,0,0,0,5,16,16,16,5,0,6
3822,0,0,2,15,16,13,1,0,0,0,...,0,0,0,4,14,1,0,0,0,7

In [3]:
 print(digits)

      0   1   2   3   4   5   6   7   8   9   ...  55  56  57  58  59  60  61  \
0      0   1   6  15  12   1   0   0   0   7  ...   0   0   0   6  14   7   1
1      0   0  10  16   6   0   0   0   0   7  ...   0   0   0  10  16  15   3
2      0   0   8  15  16  13   0   0   0   1  ...   0   0   0   9  14   0   0
3      0   0   0   3  11  16   0   0   0   0  ...   0   0   0   0   1  15   2
4      0   0   5  14   4   0   0   0   0   0  ...   0   0   0   4  12  14   7
...   ..  ..  ..  ..  ..  ..  ..  ..  ..  ..  ...  ..  ..  ..  ..  ..  ..  ..
3818   0   0   5  13  11   2   0   0   0   2  ...   0   0   0   8  13  15  10
3819   0   0   0   1  12   1   0   0   0   0  ...   0   0   0   0   4   9   0
3820   0   0   3  15   0   0   0   0   0   0  ...   0   0   0   4  14  16   9
3821   0   0   6  16   2   0   0   0   0   0  ...   0   0   0   5  16  16  16
3822   0   0   2  15  16  13   1   0   0   0  ...   0   0   0   4  14   1   0

      62  63  64
0      0   0   0
1      0   0   0
2      0   0   7
3      0   0   4
4      0   0   6
...   ..  ..  ..
3818   1   0   9
3819   0   0   4
3820   0   0   6
3821   5   0   6
3822   0   0   7

[3823 rows x 65 columns]

In [4]:
digits.describe()

,0,1,2,3,4,5,6,7,8,9,...,55,56,57,58,59,60,61,62,63,64
count,3823.0,3823.000000,3823.000000,3823.000000,3823.000000,3823.000000,3823.000000,3823.000000,3823.000000,3823.000000,...,3823.000000,3823.000000,3823.000000,3823.000000,3823.000000,3823.000000,3823.000000,3823.000000,3823.000000,3823.000000
mean,0.0,0.301334,5.481821,11.805912,11.451478,5.505362,1.387392,0.142297,0.002093,1.960502,...,0.148313,0.000262,0.283024,5.855872,11.942977,11.461156,6.700497,2.105676,0.202197,4.497253
std,0.0,0.866986,4.631601,4.259811,4.537556,5.613060,3.371444,1.051598,0.088572,3.052353,...,0.767761,0.016173,0.928046,4.980012,4.334508,4.991934,5.775815,4.028266,1.150694,2.869831
min,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,0.0,0.000000,1.000000,10.000000,9.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,1.000000,10.000000,9.000000,0.000000,0.000000,0.000000,2.000000
50%,0.0,0.000000,5.000000,13.000000,13.000000,4.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,5.000000,13.000000,13.000000,6.000000,0.000000,0.000000,4.000000
75%,0.0,0.000000,9.000000,15.000000,15.000000,10.000000,0.000000,0.000000,0.000000,3.000000,...,0.000000,0.000000,0.000000,10.000000,15.000000,16.000000,12.000000,2.000000,0.000000,7.000000
max,0.0,8.000000,16.000000,16.000000,16.000000,16.000000,16.000000,16.000000,5.000000,15.000000,...,12.000000,1.000000,10.000000,16.000000,16.000000,16.000000,16.000000,16.000000,16.000000,9.000000

In [5]:
digits.head()

,0,1,2,3,4,5,6,7,8,9,...,55,56,57,58,59,60,61,62,63,64
0,0,1,6,15,12,1,0,0,0,7,...,0,0,0,6,14,7,1,0,0,0
1,0,0,10,16,6,0,0,0,0,7,...,0,0,0,10,16,15,3,0,0,0
2,0,0,8,15,16,13,0,0,0,1,...,0,0,0,9,14,0,0,0,0,7
3,0,0,0,3,11,16,0,0,0,0,...,0,0,0,0,1,15,2,0,0,4
4,0,0,5,14,4,0,0,0,0,0,...,0,0,0,4,12,14,7,0,0,6

In [6]:
digits.tail(10)

,0,1,2,3,4,5,6,7,8,9,...,55,56,57,58,59,60,61,62,63,64
3813,0,0,0,6,8,0,0,0,0,0,...,0,0,1,4,9,8,0,0,0,4
3814,0,0,9,16,6,0,0,0,0,2,...,0,0,0,10,13,1,0,0,0,8
3815,0,0,9,16,12,1,0,0,0,3,...,0,0,0,8,16,16,16,8,0,9
3816,0,1,10,16,16,4,0,0,0,8,...,0,0,2,13,16,12,5,0,0,3
3817,0,0,6,16,11,0,0,0,0,1,...,0,0,1,7,14,16,12,1,0,9
3818,0,0,5,13,11,2,0,0,0,2,...,0,0,0,8,13,15,10,1,0,9
3819,0,0,0,1,12,1,0,0,0,0,...,0,0,0,0,4,9,0,0,0,4
3820,0,0,3,15,0,0,0,0,0,0,...,0,0,0,4,14,16,9,0,0,6
3821,0,0,6,16,2,0,0,0,0,0,...,0,0,0,5,16,16,16,5,0,6
3822,0,0,2,15,16,13,1,0,0,0,...,0,0,0,4,14,1,0,0,0,7

In [7]:
digits.sample() # Takes a random row from the DataFrame

,0,1,2,3,4,5,6,7,8,9,...,55,56,57,58,59,60,61,62,63,64
312,0,0,1,14,8,0,0,0,0,0,...,0,0,0,0,15,7,0,0,0,4

In [97]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [98]:
s = pd.Series([1,3,5,np.nan,6,8])

In [10]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [99]:
dates = pd.date_range('20130101', periods=6)

In [12]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.103953 -1.016128 -2.924043 -0.068436
2013-01-02  0.803979  1.323492  1.605142  0.393898
2013-01-03 -0.447598  0.278198  1.377190  0.447853
2013-01-04  0.117601  1.713291 -0.968969 -1.711947
2013-01-05  0.475711 -1.666247 -0.403522  1.306296
2013-01-06 -0.574540 -0.963518 -0.228337 -1.015971

In [101]:
#Creating a DataFrame by passing a dict of objects
df2 = pd.DataFrame({ 'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })

In [102]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [103]:
# The columns of the resulting DataFrame have different dtypes.
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [104]:
df2.A

0    1.0
1    1.0
2    1.0
3    1.0
Name: A, dtype: float64

In [105]:
df2.F

0    foo
1    foo
2    foo
3    foo
Name: F, dtype: object

In [106]:
df2.head()

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [20]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.117601  1.713291 -0.968969 -1.711947
2013-01-05  0.475711 -1.666247 -0.403522  1.306296
2013-01-06 -0.574540 -0.963518 -0.228337 -1.015971

In [21]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [22]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [23]:
df.values

array([[ 0.1039528 , -1.01612839, -2.9240434 , -0.06843589],
       [ 0.80397857,  1.32349213,  1.60514225,  0.39389757],
       [-0.44759802,  0.27819768,  1.37719044,  0.44785297],
       [ 0.11760089,  1.71329072, -0.96896872, -1.71194743],
       [ 0.47571061, -1.66624702, -0.4035224 ,  1.30629598],
       [-0.5745401 , -0.96351825, -0.22833694, -1.01597092]])

In [24]:
# Transposing your data:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.103953    0.803979   -0.447598    0.117601    0.475711   -0.574540
B   -1.016128    1.323492    0.278198    1.713291   -1.666247   -0.963518
C   -2.924043    1.605142    1.377190   -0.968969   -0.403522   -0.228337
D   -0.068436    0.393898    0.447853   -1.711947    1.306296   -1.015971

In [25]:
# Sorting by an axis:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.068436 -2.924043 -1.016128  0.103953
2013-01-02  0.393898  1.605142  1.323492  0.803979
2013-01-03  0.447853  1.377190  0.278198 -0.447598
2013-01-04 -1.711947 -0.968969  1.713291  0.117601
2013-01-05  1.306296 -0.403522 -1.666247  0.475711
2013-01-06 -1.015971 -0.228337 -0.963518 -0.574540

In [26]:
# Sorting by an axis:
df.sort_index(axis=1, ascending=True)

                   A         B         C         D
2013-01-01  0.103953 -1.016128 -2.924043 -0.068436
2013-01-02  0.803979  1.323492  1.605142  0.393898
2013-01-03 -0.447598  0.278198  1.377190  0.447853
2013-01-04  0.117601  1.713291 -0.968969 -1.711947
2013-01-05  0.475711 -1.666247 -0.403522  1.306296
2013-01-06 -0.574540 -0.963518 -0.228337 -1.015971

In [27]:
# Sorting by values:
df.sort_values(by='B')

                   A         B         C         D
2013-01-05  0.475711 -1.666247 -0.403522  1.306296
2013-01-01  0.103953 -1.016128 -2.924043 -0.068436
2013-01-06 -0.574540 -0.963518 -0.228337 -1.015971
2013-01-03 -0.447598  0.278198  1.377190  0.447853
2013-01-02  0.803979  1.323492  1.605142  0.393898
2013-01-04  0.117601  1.713291 -0.968969 -1.711947

In [28]:
# Selecting a single column, which yields a Series, equivalent to df.A:
df['A']

2013-01-01    0.103953
2013-01-02    0.803979
2013-01-03   -0.447598
2013-01-04    0.117601
2013-01-05    0.475711
2013-01-06   -0.574540
Freq: D, Name: A, dtype: float64

In [29]:
df.A # What happens when we do this???

2013-01-01    0.103953
2013-01-02    0.803979
2013-01-03   -0.447598
2013-01-04    0.117601
2013-01-05    0.475711
2013-01-06   -0.574540
Freq: D, Name: A, dtype: float64

In [30]:
# Selecting via [], which slices the rows.
df[0:3]

                   A         B         C         D
2013-01-01  0.103953 -1.016128 -2.924043 -0.068436
2013-01-02  0.803979  1.323492  1.605142  0.393898
2013-01-03 -0.447598  0.278198  1.377190  0.447853

In [31]:
df['20130102':'20130104'] # See any difference???

                   A         B         C         D
2013-01-02  0.803979  1.323492  1.605142  0.393898
2013-01-03 -0.447598  0.278198  1.377190  0.447853
2013-01-04  0.117601  1.713291 -0.968969 -1.711947

In [32]:
df.loc[dates[0]]

A    0.103953
B   -1.016128
C   -2.924043
D   -0.068436
Name: 2013-01-01 00:00:00, dtype: float64

In [33]:
# Selecting on a multi-axis by label:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.103953 -1.016128
2013-01-02  0.803979  1.323492
2013-01-03 -0.447598  0.278198
2013-01-04  0.117601  1.713291
2013-01-05  0.475711 -1.666247
2013-01-06 -0.574540 -0.963518

In [34]:
# Select via the position of the passed integers:
df.iloc[3]

A    0.117601
B    1.713291
C   -0.968969
D   -1.711947
Name: 2013-01-04 00:00:00, dtype: float64

In [35]:
# By integer slices, acting similar to numpy/python
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.117601  1.713291
2013-01-05  0.475711 -1.666247

In [36]:
# By lists of integer position locations, similar to the numpy/python style:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.803979  1.605142
2013-01-03 -0.447598  1.377190
2013-01-05  0.475711 -0.403522

In [37]:
# For slicing rows explicitly:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.803979  1.323492  1.605142  0.393898
2013-01-03 -0.447598  0.278198  1.377190  0.447853

In [38]:
# For slicing columns explicitly:
df.iloc[:,1:3]

                   B         C
2013-01-01 -1.016128 -2.924043
2013-01-02  1.323492  1.605142
2013-01-03  0.278198  1.377190
2013-01-04  1.713291 -0.968969
2013-01-05 -1.666247 -0.403522
2013-01-06 -0.963518 -0.228337

In [39]:
df.iloc[[0,1,3],[0,1]] # What is happening here???

                   A         B
2013-01-01  0.103953 -1.016128
2013-01-02  0.803979  1.323492
2013-01-04  0.117601  1.713291

In [40]:
# For getting a value explicitly:
df.iloc[1,1]

1.3234921345967692

In [41]:
# For getting fast access to a scalar (equivalent to the prior method):
df.iat[1,1]

1.3234921345967692

In [42]:
# Using a single column’s values to select data.
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.103953 -1.016128 -2.924043 -0.068436
2013-01-02  0.803979  1.323492  1.605142  0.393898
2013-01-04  0.117601  1.713291 -0.968969 -1.711947
2013-01-05  0.475711 -1.666247 -0.403522  1.306296

In [43]:
df[df['A'] > 0] # same as above!!!

                   A         B         C         D
2013-01-01  0.103953 -1.016128 -2.924043 -0.068436
2013-01-02  0.803979  1.323492  1.605142  0.393898
2013-01-04  0.117601  1.713291 -0.968969 -1.711947
2013-01-05  0.475711 -1.666247 -0.403522  1.306296

In [44]:
# Selecting values from a DataFrame where a boolean condition is met.
df[df > 0]

                   A         B         C         D
2013-01-01  0.103953       NaN       NaN       NaN
2013-01-02  0.803979  1.323492  1.605142  0.393898
2013-01-03       NaN  0.278198  1.377190  0.447853
2013-01-04  0.117601  1.713291       NaN       NaN
2013-01-05  0.475711       NaN       NaN  1.306296
2013-01-06       NaN       NaN       NaN       NaN

In [45]:
df[df > 0].dropna() #Remember last class? What to do with NaN???

                   A         B         C         D
2013-01-02  0.803979  1.323492  1.605142  0.393898

In [46]:
# Using the isin() method for filtering:
df2 = df.copy()
df2

                   A         B         C         D
2013-01-01  0.103953 -1.016128 -2.924043 -0.068436
2013-01-02  0.803979  1.323492  1.605142  0.393898
2013-01-03 -0.447598  0.278198  1.377190  0.447853
2013-01-04  0.117601  1.713291 -0.968969 -1.711947
2013-01-05  0.475711 -1.666247 -0.403522  1.306296
2013-01-06 -0.574540 -0.963518 -0.228337 -1.015971

In [47]:
df2['E'] = ['one', 'one','two','three','four','three'] #We're adding a column
df2

                   A         B         C         D      E
2013-01-01  0.103953 -1.016128 -2.924043 -0.068436    one
2013-01-02  0.803979  1.323492  1.605142  0.393898    one
2013-01-03 -0.447598  0.278198  1.377190  0.447853    two
2013-01-04  0.117601  1.713291 -0.968969 -1.711947  three
2013-01-05  0.475711 -1.666247 -0.403522  1.306296   four
2013-01-06 -0.574540 -0.963518 -0.228337 -1.015971  three

In [48]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.447598  0.278198  1.377190  0.447853   two
2013-01-05  0.475711 -1.666247 -0.403522  1.306296  four

In [49]:
# Setting a new column automatically aligns the data by the indexes.
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
# what are we doing here?

In [50]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [51]:
df['F'] = s1
# what are we doing here?

In [52]:
# Setting values by label:
df['F'] = s1
df

                   A         B         C         D    F
2013-01-01  0.103953 -1.016128 -2.924043 -0.068436  NaN
2013-01-02  0.803979  1.323492  1.605142  0.393898  1.0
2013-01-03 -0.447598  0.278198  1.377190  0.447853  2.0
2013-01-04  0.117601  1.713291 -0.968969 -1.711947  3.0
2013-01-05  0.475711 -1.666247 -0.403522  1.306296  4.0
2013-01-06 -0.574540 -0.963518 -0.228337 -1.015971  5.0

In [53]:
# Setting values by position:
df.iat[0,1] = 0
df
# Where is it?

                   A         B         C         D    F
2013-01-01  0.103953  0.000000 -2.924043 -0.068436  NaN
2013-01-02  0.803979  1.323492  1.605142  0.393898  1.0
2013-01-03 -0.447598  0.278198  1.377190  0.447853  2.0
2013-01-04  0.117601  1.713291 -0.968969 -1.711947  3.0
2013-01-05  0.475711 -1.666247 -0.403522  1.306296  4.0
2013-01-06 -0.574540 -0.963518 -0.228337 -1.015971  5.0

In [54]:
# Setting by assigning with a NumPy array:
df.loc[:,'D'] = np.array([5] * len(df))
# What are we doing here?

In [55]:
df

                   A         B         C  D    F
2013-01-01  0.103953  0.000000 -2.924043  5  NaN
2013-01-02  0.803979  1.323492  1.605142  5  1.0
2013-01-03 -0.447598  0.278198  1.377190  5  2.0
2013-01-04  0.117601  1.713291 -0.968969  5  3.0
2013-01-05  0.475711 -1.666247 -0.403522  5  4.0
2013-01-06 -0.574540 -0.963518 -0.228337  5  5.0

In [56]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2
#What are we doing here?

                   A         B         C  D    F
2013-01-01 -0.103953  0.000000 -2.924043 -5  NaN
2013-01-02 -0.803979 -1.323492 -1.605142 -5 -1.0
2013-01-03 -0.447598 -0.278198 -1.377190 -5 -2.0
2013-01-04 -0.117601 -1.713291 -0.968969 -5 -3.0
2013-01-05 -0.475711 -1.666247 -0.403522 -5 -4.0
2013-01-06 -0.574540 -0.963518 -0.228337 -5 -5.0

In [57]:
# Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [58]:
dates[0:4]

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04'], dtype='datetime64[ns]', freq='D')

In [59]:
list(df.columns)

['A', 'B', 'C', 'D', 'F']

In [60]:
df1.loc[dates[0]:dates[1],'E'] = 1
df1
# what happend here?

                   A         B         C  D    F    E
2013-01-01  0.103953  0.000000 -2.924043  5  NaN  1.0
2013-01-02  0.803979  1.323492  1.605142  5  1.0  1.0
2013-01-03 -0.447598  0.278198  1.377190  5  2.0  NaN
2013-01-04  0.117601  1.713291 -0.968969  5  3.0  NaN

In [61]:
# To drop any rows that have missing data.
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02  0.803979  1.323492  1.605142  5  1.0  1.0

In [62]:
df1.dropna()
# whay does this work the same as above? 
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html

                   A         B         C  D    F    E
2013-01-02  0.803979  1.323492  1.605142  5  1.0  1.0

In [63]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.103953  0.000000 -2.924043  5  5.0  1.0
2013-01-02  0.803979  1.323492  1.605142  5  1.0  1.0
2013-01-03 -0.447598  0.278198  1.377190  5  2.0  5.0
2013-01-04  0.117601  1.713291 -0.968969  5  3.0  5.0

In [64]:
# To get the boolean mask where values are nan.
pd.isna(df1)
# what is a mask?

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

## Operations

In [65]:
df.mean(1)

2013-01-01    0.544977
2013-01-02    1.946523
2013-01-03    1.641558
2013-01-04    1.772385
2013-01-05    1.481188
2013-01-06    1.646721
Freq: D, dtype: float64

In [66]:
df.mean()

A    0.079851
B    0.114203
C   -0.257090
D    5.000000
F    3.000000
dtype: float64

In [67]:
# Applying functions to the data:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.103953  0.000000 -2.924043   5   NaN
2013-01-02  0.907931  1.323492 -1.318901  10   1.0
2013-01-03  0.460333  1.601690  0.058289  15   3.0
2013-01-04  0.577934  3.314981 -0.910679  20   6.0
2013-01-05  1.053645  1.648734 -1.314202  25  10.0
2013-01-06  0.479105  0.685215 -1.542539  30  15.0

In [68]:
df.apply(lambda x: x.max() - x.min())

A    1.378519
B    3.379538
C    4.529186
D    0.000000
F    4.000000
dtype: float64

In [69]:
# String Methods
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [70]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [71]:
# Concatenating pandas objects together with concat():
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  1.385222  0.252774 -0.896460 -1.579134
1 -0.855902 -1.195414  0.171703 -0.888202
2  0.487730 -0.409057  0.010697 -0.447579
3 -0.825613  0.123224  0.595600  1.804101
4 -0.444320  1.541948 -0.460509  0.717334
5 -0.611178 -0.528486 -0.066630  0.070647
6 -0.885232  0.762857  0.574153  0.431636
7  2.103066  0.808493  0.110075 -0.427803
8  0.392828 -0.893986 -0.300852  0.681352
9  0.944282  0.980478  1.083196 -0.342973

In [72]:
# break it into pieces
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  1.385222  0.252774 -0.896460 -1.579134
 1 -0.855902 -1.195414  0.171703 -0.888202
 2  0.487730 -0.409057  0.010697 -0.447579,
           0         1         2         3
 3 -0.825613  0.123224  0.595600  1.804101
 4 -0.444320  1.541948 -0.460509  0.717334
 5 -0.611178 -0.528486 -0.066630  0.070647
 6 -0.885232  0.762857  0.574153  0.431636,
           0         1         2         3
 7  2.103066  0.808493  0.110075 -0.427803
 8  0.392828 -0.893986 -0.300852  0.681352
 9  0.944282  0.980478  1.083196 -0.342973]

In [73]:
pd.concat(pieces)

          0         1         2         3
0  1.385222  0.252774 -0.896460 -1.579134
1 -0.855902 -1.195414  0.171703 -0.888202
2  0.487730 -0.409057  0.010697 -0.447579
3 -0.825613  0.123224  0.595600  1.804101
4 -0.444320  1.541948 -0.460509  0.717334
5 -0.611178 -0.528486 -0.066630  0.070647
6 -0.885232  0.762857  0.574153  0.431636
7  2.103066  0.808493  0.110075 -0.427803
8  0.392828 -0.893986 -0.300852  0.681352
9  0.944282  0.980478  1.083196 -0.342973

In [74]:
# Join - SQL style merges. See the Database style joining section.
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
left

   key  lval
0  foo     1
1  foo     2

In [75]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
right

   key  rval
0  foo     4
1  foo     5

In [76]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [77]:
# Append rows to a dataframe. 
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

          A         B         C         D
0 -1.262359  0.334352  0.599889  0.491721
1  0.158185 -0.768690  0.701015  0.578487
2 -1.754808 -1.342606  1.461614  0.712932
3 -0.536193  1.402109  0.347407 -0.619812
4  1.653075  0.254749  1.334884 -1.115144
5  0.356155  0.647943 -0.467428  0.965908
6  0.641959 -0.149346 -1.019007  1.184384
7  0.378371  0.670652  3.044233  0.089668

In [78]:
s = df.iloc[3]
s

A   -0.536193
B    1.402109
C    0.347407
D   -0.619812
Name: 3, dtype: float64

In [79]:
df.append(s, ignore_index=True)
# What happend here?

          A         B         C         D
0 -1.262359  0.334352  0.599889  0.491721
1  0.158185 -0.768690  0.701015  0.578487
2 -1.754808 -1.342606  1.461614  0.712932
3 -0.536193  1.402109  0.347407 -0.619812
4  1.653075  0.254749  1.334884 -1.115144
5  0.356155  0.647943 -0.467428  0.965908
6  0.641959 -0.149346 -1.019007  1.184384
7  0.378371  0.670652  3.044233  0.089668
8 -0.536193  1.402109  0.347407 -0.619812

<b>Groupping </b>

By “group by” we are referring to a process involving one or more of the following steps:

* Splitting the data into groups based on some criteria
* Applying a function to each group independently
* Combining the results into a data structure

In [80]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
'foo', 'bar', 'foo', 'foo'],
'B' : ['one', 'one', 'two', 'three',
'two', 'two', 'one', 'three'],
'C' : np.random.randn(8),
'D' : np.random.randn(8)})

df

     A      B         C         D
0  foo    one  1.710469  1.117548
1  bar    one -0.976464  1.085195
2  foo    two -0.506326  0.412068
3  bar  three -2.122096  0.649271
4  foo    two -0.538581  0.641600
5  bar    two  0.659014  0.259356
6  foo    one -1.593691 -0.120619
7  foo  three  1.233048 -0.857819

In [81]:
# Grouping and then applying the sum() function to the resulting groups.
df.groupby('A').sum()

            C         D
A
bar -2.439546  1.993822
foo  0.304920  1.192778

In [82]:
# Grouping by multiple columns forms a hierarchical index, and again we can apply the sum function.
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.976464  1.085195
    three -2.122096  0.649271
    two    0.659014  0.259356
foo one    0.116779  0.996929
    three  1.233048 -0.857819
    two   -1.044907  1.053668

In [83]:
# Stack
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
'foo', 'foo', 'qux', 'qux'],
['one', 'two', 'one', 'two',
'one', 'two', 'one', 'two']]))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [84]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
# MultiIndex.from_tuples() function is used to convert list of tuples to MultiIndex. 
# It is one of the several ways in which we construct a MultiIndex.
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [85]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [86]:
df2 = df[:4]
df2

                     A         B
first second
bar   one     0.281799  1.898297
      two     1.812226 -0.233375
baz   one    -0.824481  1.057640
      two    -0.358214  1.042796

In [87]:
# The stack() method “compresses” a level in the DataFrame’s columns.
stacked = df2.stack()
stacked

first  second
bar    one     A    0.281799
               B    1.898297
       two     A    1.812226
               B   -0.233375
baz    one     A   -0.824481
               B    1.057640
       two     A   -0.358214
               B    1.042796
dtype: float64

With a “stacked” DataFrame or Series (having a MultiIndex as the index), the inverse operation of stack() is unstack(), which by default unstacks the last level:

In [88]:
stacked.unstack()

                     A         B
first second
bar   one     0.281799  1.898297
      two     1.812226 -0.233375
baz   one    -0.824481  1.057640
      two    -0.358214  1.042796

In [89]:
# Pivot Tables

df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
'B' : ['A', 'B', 'C'] * 4,
'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
'D' : np.random.randn(12),
'E' : np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo  0.687309 -1.139996
1     one  B  foo  1.306878 -1.452076
2     two  C  foo -0.542695  0.667152
3   three  A  bar  0.677064 -2.385729
4     one  B  bar  0.364227 -1.603254
5     one  C  bar -1.830677  0.640373
6     two  A  foo -0.086277  2.229490
7   three  B  foo  1.719041 -0.974493
8     one  C  foo -0.647912 -0.815154
9     one  A  bar -1.282681  0.917681
10    two  B  bar  2.129712 -0.187352
11  three  C  bar -1.332592 -0.346406

In [90]:
# We can produce pivot tables from this data very easily:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])
# What happened here?

C             bar       foo
A     B
one   A -1.282681  0.687309
      B  0.364227  1.306878
      C -1.830677 -0.647912
three A  0.677064       NaN
      B       NaN  1.719041
      C -1.332592       NaN
two   A       NaN -0.086277
      B  2.129712       NaN
      C       NaN -0.542695

In [91]:
# Time Series

rng = pd.date_range('1/1/2012', periods=100, freq='S') # S = secondly frequency

rng[0:6] #remember that this is called to slice
#

DatetimeIndex(['2012-01-01 00:00:00', '2012-01-01 00:00:01',
               '2012-01-01 00:00:02', '2012-01-01 00:00:03',
               '2012-01-01 00:00:04', '2012-01-01 00:00:05'],
              dtype='datetime64[ns]', freq='S')

__[More about Slicing Time Series here](https://stackoverflow.com/questions/49868647/how-to-slice-a-pandas-dataframe-based-on-datetime-index
)__

In [92]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts

2012-01-01 00:00:00    164
2012-01-01 00:00:01     13
2012-01-01 00:00:02     68
2012-01-01 00:00:03    368
2012-01-01 00:00:04     88
                      ...
2012-01-01 00:01:35    199
2012-01-01 00:01:36    301
2012-01-01 00:01:37    194
2012-01-01 00:01:38    146
2012-01-01 00:01:39    481
Freq: S, Length: 100, dtype: int32

In [93]:
ts.resample('5Min').sum()

2012-01-01    23942
Freq: 5T, dtype: int32

In [94]:
# Time zone representation:

rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')
ts = pd.Series(np.random.randn(len(rng)), rng)
ts

2012-03-06    0.903899
2012-03-07   -0.131142
2012-03-08   -0.670631
2012-03-09   -0.239071
2012-03-10    1.037707
Freq: D, dtype: float64

In [95]:
ts_utc = ts.tz_localize('UTC')
ts_utc

2012-03-06 00:00:00+00:00    0.903899
2012-03-07 00:00:00+00:00   -0.131142
2012-03-08 00:00:00+00:00   -0.670631
2012-03-09 00:00:00+00:00   -0.239071
2012-03-10 00:00:00+00:00    1.037707
Freq: D, dtype: float64

In [96]:
# Converting to another time zone:

ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00    0.903899
2012-03-06 19:00:00-05:00   -0.131142
2012-03-07 19:00:00-05:00   -0.670631
2012-03-08 19:00:00-05:00   -0.239071
2012-03-09 19:00:00-05:00    1.037707
Freq: D, dtype: float64